Table of Contents
 Enum TypeResultsClass
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
TypeResultsClass
public enum TypeResultsClass
Fields
CheckClassBridgeLoadRating = 10
CheckClassBridgeLoadRating
CheckClassFireResistance = 9
CheckClassFireResistance
FatigueResultsClass = 8
FatigueResultsClass
SLSCharacteristicsCheckClass = 5
SLSCharacteristicsCheckClass
SLSDeflectionResultsClass = 6
SLSDeflectionResultsClass
SLSFrequentCheckClass = 3
SLSFrequentCheckClass
SLSQuasiPermanentCheckClass = 4
SLSQuasiPermanentCheckClass
SLSResultsClass = 1
SLSResultsClass
ULSAccidentalResultsClass = 7
ULSAccidentalResultsClass
ULSCheckClass = 2
ULSCheckClass
ULSResultsClass = 0
ULSResultsClass
Fields
 Name |  Description
 CheckClassBridgeLoadRating = 10
CheckClassBridgeLoadRating
 CheckClassFireResistance = 9
CheckClassFireResistance
 FatigueResultsClass = 8
FatigueResultsClass
 SLSCharacteristicsCheckClass = 5
SLSCharacteristicsCheckClass
 SLSDeflectionResultsClass = 6
SLSDeflectionResultsClass
 SLSFrequentCheckClass = 3
SLSFrequentCheckClass
 SLSQuasiPermanentCheckClass = 4
SLSQuasiPermanentCheckClass
 SLSResultsClass = 1
SLSResultsClass
 ULSAccidentalResultsClass = 7
ULSAccidentalResultsClass
 ULSCheckClass = 2
ULSCheckClass
 ULSResultsClass = 0
ULSResultsClass
 Edit this page